using Tyuiu.MolokanovNK.Sprint2.Task3.V19.Lib;

DataService ds = new DataService();

Console.Title = "Спринт #1 | Выполнила : Молоканов Н. К. | ИБКСб-25-1";
//Длина строки 75 символов
Console.WriteLine("**************************************************************************************************");
Console.WriteLine("* Спринт #1                                                                                      *");
Console.WriteLine("* Тема: Базовые навыки работы в C#                                                               *");
Console.WriteLine("* Задание #3                                                                                     *");
Console.WriteLine("* Вариант #19                                                                                    *");
Console.WriteLine("* Выполнил: Молоканов Никита Константинович | ИБКСб-25-1                                         *");
Console.WriteLine("**************************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                       *");
Console.WriteLine("* Написать программу,                                                                            *");
Console.WriteLine("* которая вычисляет требуемое значение функции Y с использованием вложенных оператор if-else,    *");
Console.WriteLine("* где пользователь вводит значение переменной X с клавиатуры.                                    *");
Console.WriteLine("* Округлить полученное значение до трех знаков после запятой                                     *");
Console.WriteLine("**************************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                               *");
Console.WriteLine("**************************************************************************************************");

Console.WriteLine("Введите значение X:");
double x = Convert.ToInt32(Console.ReadLine());
double res = ds.Calculate(x);

Console.WriteLine("**************************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                     *");

Console.WriteLine("Значение функции = " + res);



Console.ReadLine();
