using Tyuiu.MolokanovNK.Sprint2.Task6.V5.Lib;
DataService ds = new DataService();

Console.Title = "Спринт #1 | Выполнила : Молоканов Н. К. | ИБКСб-25-1";
//Длина строки 75 символов
Console.WriteLine("***************************************************************************************************************************");
Console.WriteLine("* Спринт #1                                                                                                               *");
Console.WriteLine("* Тема: Базовые навыки работы в C#                                                                                        *");
Console.WriteLine("* Задание #6                                                                                                              *");
Console.WriteLine("* Вариант #5                                                                                                              *");
Console.WriteLine("* Выполнил: Молоканов Никита Константинович | ИБКСб-25-1                                                                  *");
Console.WriteLine("***************************************************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                                                *");
Console.WriteLine("* Написать программу,                                                                                                     *");
Console.WriteLine("* которая использует сокращенную форму записи оператора switch вычисляет требуемое значение и возвращает результат.       *");
Console.WriteLine("***************************************************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                                        *");
Console.WriteLine("***************************************************************************************************************************");

Console.WriteLine("Введите номер карты: ");
int numCard = Convert.ToInt32(Console.ReadLine());

string res;

if ((numCard < 6) || (numCard > 14))
{
    res = "Введенно неверное значение!";
}
else
{
    res = "Эта карта: " + ds.FindCardValue(numCard);
}

Console.WriteLine("***************************************************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                                              *");


Console.WriteLine(res);


Console.ReadLine();